<?php

/*变量的传值与引用  
  不用'&'相当于变量拷贝：'='左边会生成一个与'='右边一模一样的变量，当把左边的变量赋值为0，或者NULL，右边的变量还是之前的值，不会随着变0，或者NULL；
  用'&'相当于引用：'='左边会指向与'='右边一样的存储值，而不是指向'='右边的变量，当把左边的变量赋值为0，或者NULL，右边的变量也会随着变0，或者NULL；
*/
/*
$a = 5;
$b = &$a;
echo $a.'<br/>';echo $b.'<hr/>';
$a = 0;
echo $a.'<br/>';echo $b;exit;
*/

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

















































